app/controllers/auth/registrations_controller.rb

  def create
    super do |user|
      # After creating the user, check if it's the first user and make them an admin
      if User.count == 1
        user.update(role: 'admin',admin: true)
---
SELECT COUNT(*) FROM "users"
UPDATE "users" SET "updated_at" = ?, "role" = ?, "admin" = ? WHERE "users"."id" = ?  [["updated_at", "2023-09-05 08:35:12.993392"], ["role", 1], ["admin", 1], ["id", 1]]