app/controllers/admin/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "image_url", "shoe_type", "shoe_design", "created_at", "updated_at", "brand_id", "gender") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)
    if @product.save

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 7]]
---
  def destroy
    if @product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def find_product
    @product = Product.find(params[:id])