app/controllers/carts_controller.rb

    def add_item
      user = current_user

      # Ensure the user has a cart
      user.create_cart unless user.cart

      product_id = params[:product_id]
      quantity = params[:quantity]

      # Find the product based on product_id (you'll need to implement this)
      product = Product.find(product_id)

      # Add the product to the user's cart (you'll need to implement this)
      user.cart.add_product(product, quantity)

      # Save the cart
      user.cart.save
---
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2023-09-05 08:15:46.930008"], ["updated_at", "2023-09-05 08:15:46.930008"]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]