app/models/cart.rb

  def add_product(product, quantity)
    existing_item = cart_items.find_by(product_id: product.id)

    if existing_item
      # If the product already exists in the cart, update its quantity
      existing_item.update(quantity: existing_item.quantity + quantity)
    else
      # If the product is not in the cart, create a new cart item
      cart_items.create(product: product, quantity: quantity)
---
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 4], ["updated_at", "2023-09-05 08:19:10.644885"], ["id", 1]]
INSERT INTO "cart_items" ("cart_id", "product_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 1], ["product_id", 1], ["quantity", 2], ["created_at", "2023-09-05 08:17:56.339135"], ["updated_at", "2023-09-05 08:17:56.339135"]]